driver-tests/bpelse/xsddatatypes/XSDDataTypesBpel/src/MsgTypeToXSDType/xsddatatype2.wsdl

<definitions targetNamespace="http://stc.com/xsddatatype2" 
                name="xsddatatype2" 
                xmlns:tns="http://stc.com/xsddatatype2" 
                xmlns:ns1="urn:SampleXSD"                 
                xmlns:slnk1="http://docs.oasis-open.org/wsbpel/2.0/plnktype" 
                xmlns:tns0="http://stc.com/xsddatatype2" 
                xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
                xmlns="http://schemas.xmlsoap.org/wsdl/" 
                xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
                xmlns:slnk="http://schemas.xmlsoap.org/ws/2002/07/service-link/">
        <import location="SampleXSD.xsd" namespace="urn:SampleXSD"/>        
	<message name="xsddatatype2">
		<part name="part" element="ns1:Item"/>
	</message>
	<portType name="xsddatatype2">
		<operation name="xsddatatype2">
			<input message="tns:xsddatatype2"/>
			<output message="tns:xsddatatype2"/>
		</operation>
	</portType>
	<binding name="Binding" type="tns:xsddatatype2">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="xsddatatype2">
			<soap:operation soapAction="xsddatatype2"/>
			<input>
				<soap:body use="literal"/>
			</input>
			<output>
				<soap:body use="literal"/>
			</output>
		</operation>
	</binding>
	<service name="xsddatatype2Service">
		<port name="port" binding="tns:Binding">
			<soap:address location="http://localhost:${HttpDefaultPort}/xsddatatype2"/>
		</port>
	</service>
	<plnk:partnerLinkType name="SLT" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
		<plnk:role name="server" portType="tns:xsddatatype2"/>
	</plnk:partnerLinkType>
</definitions>
