driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/XSDVariables_Complex_Expressions4/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:Item xmlns:msgns="http://stc.com/XSDVariables_Complex_Expressions4" xmlns:ns1="urn:SampleXSD">
      <value xmlns="urn:SampleXSD">12345BooleanNegative</value>
    </ns1:Item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
