driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/results/MsgTypeToXSDType3/Actual_20130311131750_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <Item xmlns="urn:SampleXSD" xmlns:msgns="http://stc.com/xsddatatype3" xmlns:ns0="urn:SampleXSD" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <ns0:value>Hello</ns0:value>
    </Item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>