driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/MsgTypeToXSDType2/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="urn:SampleXSD">
  <soapenv:Body>
    <ns0:Item>
      <ns0:value>Hello</ns0:value>
    </ns0:Item>
  </soapenv:Body>
</soapenv:Envelope>